### Example 1 - Removing duplicate data

Usually in ML applications, we want to remove exact duplicates from the dataset, because they might reinforce incorrect trends into the ML model.

In [9]:
import numpy as np
import pandas as pd

In [10]:
df = pd.read_csv("ranges_duplicates.csv")

In [11]:
df

    Measurement   Region   Range
0        881792   Europe    High
1        867134  America    High
2        241654     Asia     Low
3        456234   Europe  Middle
4        301892  America     Low
5        654132  America    High
6        540275     Asia  Middle
7        467122     Asia  Middle
8         68512   Europe     Low
9        867134  America    High
10       241654     Asia     Low
11       456234   Europe  Middle

**We usually want to remove all duplicate data, so our analysis and ML models don't get unrealistic representation for certain rows in data (optimization)**

In [12]:
# we seem to have 3 duplicate rows in the data
df.duplicated().sum()

np.int64(3)

In [13]:
# removing duplicates is luckily easy
df = df.drop_duplicates()

In [14]:
# we seem to have 3 duplicate rows in the data
df.duplicated().sum()

np.int64(0)

In [15]:
df

   Measurement   Region   Range
0       881792   Europe    High
1       867134  America    High
2       241654     Asia     Low
3       456234   Europe  Middle
4       301892  America     Low
5       654132  America    High
6       540275     Asia  Middle
7       467122     Asia  Middle
8        68512   Europe     Low